cask_args appdir: "/Applications"

# Core development tools
brew "git"
brew "gh"
brew "neovim"
brew "zsh"
brew "tmux"

# Shell ergonomics
brew "starship"
brew "fzf"
brew "zoxide"
brew "direnv"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# Terminal font with Nerd Font / Powerline glyphs for Starship
cask "font-jetbrains-mono-nerd-font"

# Data, file, and network utilities
brew "jq"
brew "yq"
brew "tree"
brew "watch"
brew "wget"
brew "dos2unix"

# Build and formatting tools
brew "cmake"
brew "shellcheck"
brew "shfmt"
brew "universal-ctags"

# Language runtimes and package managers
brew "go"
brew "node"
brew "pnpm"
brew "yarn"
brew "python"
brew "uv"
brew "rbenv"
brew "ruby-build"
